11/data/attachments/cae0887d187a4d50.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:username>
            <nif:friendToBeAdded>Richard_which_Friend_11999_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>